d20ltg/app/controllers/page_contents_controller.rb

  def home
    @content = PageContent.find_by_name('home')
---
SELECT  "page_contents".* FROM "page_contents"  WHERE "page_contents"."name" = 'home' LIMIT 1